submit_form/app/controllers/accordion_leads_controller.rb

SELECT * FROM `accordion_leads`
---
  def index
    @accordion_leads = AccordionLead.all

SELECT * FROM `accordion_leads` WHERE (`accordion_leads`.`id` = 19)
---
  def show
    @accordion_lead = AccordionLead.find(params[:id])

INSERT INTO `accordion_leads` (`address1`, `city`, `phone_area`, `zip`, `created_at`, `address2`, `ampm`, `country`, `counselor_code`, `abtest_version`, `updated_at`, `time`, `career_choice`, `timezone`, `adspace_id`, `processed`, `teach_cert`, `major`, `begin_time`, `projected_start`, `loed`, `phone2`, `user_ip_number`, `phone`, `last_name`, `institution_name`, `employer`, `institution_url`, `recruiting`, `source`, `citizen_or_pr`, `age`, `accordion_id`, `user_ip_country`, `state`, `first_name`, `email`, `program_name`, `phone2_area`, `minor`) VALUES('Ho Chi Minh', 'Ho Chi Minh', '+84', '', '2011-07-27 02:19:32', 'Ho Chi Minh', 'AMPM', 'Vietnam', 'stage', '', '2011-07-27 02:19:32', '', 'Choise any career', '', '1', NULL, 0, 'Information', '', '', 'Loed', '12345678', '123456', '123456789', 'Le-Cao', '', 'Cuong Le-Cao', 'www.institution.url', 12.0, 'www.google.com', 0, 24, 1, '12345', 'Ho Chi Minh', 'Cuong', 'cuonglc@gmail.com', 'Master', '+38', 'Economy')
---
  def create
    @accordion_lead = AccordionLead.new(params[:accordion_lead])

    respond_to do |format|
      if @accordion_lead.save